app/controllers/posts_controller.rb

INSERT INTO "posts" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "fdfd"], ["created_at", "2017-12-27 17:47:08.552985"], ["updated_at", "2017-12-27 17:47:08.552985"]]
---
  def create
  	@post = Post.new(permit_post)
  	if @post.save